iNavFlight/inav/lib/main/STM32F7/Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sd.c
/**
  ******************************************************************************
  * @file    stm32f769i_eval_sd.c
  * @author  MCD Application Team
  * @brief   This file includes the uSD card driver mounted on STM32F769I-EVAL 
  *          evaluation boards.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  How To use this driver:
  -----------------------
   - This driver is used to drive the micro SD external cards mounted on STM32F769I-EVAL
     evaluation board.
   - This driver does not need a specific component driver for the micro SD device
     to be included with.

  Driver description:
  ------------------
  + Initialization steps:
     o Initialize the micro SD card using the BSP_SD_InitEx() function. This 
       function includes the MSP layer hardware resources initialization and the
       SDIO interface configuration to interface with the external micro SD. It 
       also includes the micro SD initialization sequence for SDCard1 or SDCard2.
       When BSP_SD_Init() is called, SDCard1 is by default initialized.
     o To check the SD card presence you can use the function BSP_SD_IsDetectedEx() which 
       returns the detection status for SDCard1 or SDCard2.
       the function BSP_SD_IsDetected() returns the detection status for SDCard1.
     o If SD presence detection interrupt mode is desired, you must configure the 
       SD detection interrupt mode by calling the functions BSP_SD_ITConfig() for
       SDCard1 or BSP_SD_ITConfigEx() for SDCard2 . The interrupt is generated as 
       an external interrupt whenever the micro SD card is plugged/unplugged
       in/from the evaluation board. The SD detection is managed by MFX, so the 
       SD detection interrupt has to be treated by MFX_IRQOUT gpio pin IRQ handler.
     o The function BSP_SD_GetCardInfo()/BSP_SD_GetCardInfoEx() are used to get 
       the micro SD card information which is stored in the structure 
       "HAL_SD_CardInfoTypedef".

  + Micro SD card operations
     o The micro SD card can be accessed with read/write block(s) operations once 
       it is ready for access. The access, by default to SDCard1, can be performed whether 
       using the polling mode by calling the functions BSP_SD_ReadBlocks()/BSP_SD_WriteBlocks(),  
       or by DMA transfer using the functions BSP_SD_ReadBlocks_DMA()/BSP_SD_WriteBlocks_DMA().
       The access can be performed to SDCard1 or SDCard2 by calling BSP_SD_ReadBlocksEx(),
       BSP_SD_WriteBlocksEx() or by calling BSP_SD_ReadBlocks_DMAEx()/BSP_SD_WriteBlocks_DMAEx().
     o The DMA transfer complete is used with interrupt mode. Once the SD transfer
       is complete, the SD interrupt is handled using the function BSP_SDMMC1_IRQHandler()
       when SDCard1 is used or BSP_SDMMC2_IRQHandler() when SDCard2 is used.
       The DMA Tx/Rx transfer complete are handled using the functions
       BSP_SDMMC1_DMA_Tx_IRQHandler(), BSP_SDMMC1_DMA_Rx_IRQHandler(), 
       BSP_SDMMC2_DMA_Tx_IRQHandler(), BSP_SDMMC2_DMA_Rx_IRQHandler(). The corresponding
       user callbacks are implemented by the user at application level. 
     o The SD erase block(s) is performed using the functions BSP_SD_Erase()/BSP_SD_EraseEx() 
       with specifying the number of blocks to erase.
     o The SD runtime status is returned when calling the function BSP_SD_GetCardState()
       BSP_SD_GetCardStateEx().

  @endverbatim
  ******************************************************************************
  */ 

/* Dependencies
- stm32f769i_eval.c
- stm32f7xx_hal_sd.c
- stm32f7xx_ll_sdmmc.c
- stm32f7xx_hal_dma.c  
- stm32f7xx_hal_gpio.c
- stm32f7xx_hal_cortex.c
- stm32f7xx_hal_rcc_ex.h
EndDependencies */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f769i_eval_sd.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32F769I_EVAL
  * @{
  */ 
  
/** @defgroup STM32F769I_EVAL_SD STM32F769I_EVAL SD
  * @{
  */ 


/** @defgroup STM32F769I_EVAL_SD_Private_TypesDefinitions SD Private TypesDefinitions
  * @{
  */
/**
  * @}
  */ 

/** @defgroup STM32F769I_EVAL_SD_Private_Defines SD Private Defines
  * @{
  */
/**
  * @}
  */ 
  
/** @defgroup STM32F769I_EVAL_SD_Private_Macros SD Private Macros
  * @{
  */    
/**
  * @}
  */  

/** @defgroup STM32F769I_EVAL_SD_Private_Variables SD Private Variables
  * @{
  */
SD_HandleTypeDef uSdHandle;
SD_HandleTypeDef uSdHandle2;
static uint8_t UseExtiModeDetection = 0;

/**
  * @}
  */ 
  
/** @defgroup STM32F769I_EVAL_SD_Private_Functions_Prototypes SD Private Functions Prototypes
  * @{
  */
/**
  * @}
  */ 
  
/** @defgroup STM32F769I_EVAL_SD_Private_Functions SD Private Functions
  * @{
  */

/**
  * @brief  Initializes the SD card device.
  * @retval SD status
  */
uint8_t BSP_SD_Init(void)
{ 
  /* By default, initialize SDMMC1 */
  return BSP_SD_InitEx(SD_CARD1);
}

/**
  * @brief  Initializes the SD card device.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2 
  * @retval SD status
  */
uint8_t BSP_SD_InitEx(uint32_t SdCard)
{ 
  uint8_t sd_state = MSD_OK;
  
  /* uSD device interface configuration */
  if(SdCard == SD_CARD1)
  {  
    uSdHandle.Instance = SDMMC1;
    uSdHandle.Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    uSdHandle.Init.ClockBypass         = SDMMC_CLOCK_BYPASS_DISABLE;
    uSdHandle.Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    uSdHandle.Init.BusWide             = SDMMC_BUS_WIDE_1B;
    uSdHandle.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    uSdHandle.Init.ClockDiv            = SDMMC_TRANSFER_CLK_DIV;
  }
  else
  {
    uSdHandle2.Instance = SDMMC2;
    uSdHandle2.Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    uSdHandle2.Init.ClockBypass         = SDMMC_CLOCK_BYPASS_DISABLE;
    uSdHandle2.Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    uSdHandle2.Init.BusWide             = SDMMC_BUS_WIDE_1B;
    uSdHandle2.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    uSdHandle2.Init.ClockDiv            = SDMMC_TRANSFER_CLK_DIV;   
  }
  /* Initialize IO functionalities (MFX) used by SD detect pin */
  BSP_IO_Init(); 
  
  /* Check if the SD card is plugged in the slot */
  if(SdCard == SD_CARD1)
  {
    BSP_IO_ConfigPin(SD1_DETECT_PIN, IO_MODE_INPUT_PU);
    
    if(BSP_SD_IsDetected() != SD_PRESENT)
    {
      return MSD_ERROR_SD_NOT_PRESENT;
    }
    
    /* Msp SD initialization */
    BSP_SD_MspInit(&uSdHandle, NULL);
    
