iNavFlight/inav/lib/main/STM32F7/Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sd.c
    /* HAL SD initialization */
    if(HAL_SD_Init(&uSdHandle) != HAL_OK)
    {
      sd_state = MSD_ERROR;
    }  
  }
  else
  {
    BSP_IO_ConfigPin(SD2_DETECT_PIN, IO_MODE_INPUT_PU);
    
    if(BSP_SD_IsDetectedEx(SD_CARD2) != SD_PRESENT)
    {
      return MSD_ERROR_SD_NOT_PRESENT;
    }
    /* Msp SD initialization */
    BSP_SD_MspInit(&uSdHandle2, NULL);
    
    /* HAL SD initialization */
    if(HAL_SD_Init(&uSdHandle2) != HAL_OK)
    {
      sd_state = MSD_ERROR;
    }    
  }
  
  
  /* Configure SD Bus width */
  if(sd_state == MSD_OK)
  {
    if(SdCard == SD_CARD1)
    {    
      /* Enable wide operation */
      sd_state = HAL_SD_ConfigWideBusOperation(&uSdHandle, SDMMC_BUS_WIDE_4B); 
    }
    else
    {
      /* Enable wide operation */    
      sd_state = HAL_SD_ConfigWideBusOperation(&uSdHandle2, SDMMC_BUS_WIDE_4B);
    }
    if(sd_state != HAL_OK)
    {
      sd_state = MSD_ERROR;
    }
    else
    {
      sd_state = MSD_OK;
    }
  }
  
  return  sd_state;
}


/**
  * @brief  DeInitializes the SD card device.
  * @retval SD status
  */
uint8_t BSP_SD_DeInit(void)
{
  /* By default, DeInitialize SDMMC1 */
  return BSP_SD_DeInitEx(SD_CARD1);
}

/**
  * @brief  DeInitializes the SD card device.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2 
  * @retval SD status
  */
uint8_t BSP_SD_DeInitEx(uint32_t SdCard)
{ 
  uint8_t sd_state = MSD_OK;
  
  /* Set back Mfx pin to INPUT mode in case it was in exti */
  UseExtiModeDetection = 0;
  if(SdCard == SD_CARD1)
  {
    uSdHandle.Instance = SDMMC1;    
    /* HAL SD deinitialization */
    if(HAL_SD_DeInit(&uSdHandle) != HAL_OK)
    {
      sd_state = MSD_ERROR;
    }
    
    /* Msp SD deinitialization */
    BSP_SD_MspDeInit(&uSdHandle, NULL);    
    BSP_IO_ConfigPin(SD1_DETECT_PIN, IO_MODE_INPUT_PU);
  }
  else
  {
    uSdHandle2.Instance = SDMMC2;    
    BSP_IO_ConfigPin(SD2_DETECT_PIN, IO_MODE_INPUT_PU); 
    
    /* HAL SD deinitialization */
    if(HAL_SD_DeInit(&uSdHandle2) != HAL_OK)
    {
      sd_state = MSD_ERROR;
    }
    
    /* Msp SD deinitialization */
    BSP_SD_MspDeInit(&uSdHandle2, NULL);
  }  
  return  sd_state;
}

/**
  * @brief  Configures Interrupt mode for SD1 detection pin.
  * @retval Returns 0
  */
uint8_t BSP_SD_ITConfig(void)
{  
  /* Configure Interrupt mode for SD1 detection pin */  
  /* Note: disabling exti mode can be done calling BSP_SD_DeInit() */
  UseExtiModeDetection = 1;  
  BSP_SD_IsDetected();

  return 0;
}

/**
  * @brief  Configures Interrupt mode for SD detection pin.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2
  * @retval Returns 0
  */
uint8_t BSP_SD_ITConfigEx(uint32_t SdCard)
{  
  /* Configure Interrupt mode for SD2 detection pin */  
  /* Note: disabling exti mode can be done calling BSP_SD_DeInitEx(SD_CARD2) */
  UseExtiModeDetection = 1;  
  BSP_SD_IsDetectedEx(SdCard);

  return 0;
}

/**
 * @brief  Detects if SD card is correctly plugged in the memory slot or not.
 * @retval Returns if SD is detected or not
 */
uint8_t BSP_SD_IsDetected(void)
{
  return BSP_SD_IsDetectedEx(SD_CARD1);
}

/**
 * @brief  Detects if SD card is correctly plugged in the memory slot or not.
 * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2 
 * @retval Returns if SD is detected or not
 */
uint8_t BSP_SD_IsDetectedEx(uint32_t SdCard)
{
  __IO uint8_t status = SD_PRESENT;
  
  if(SdCard == SD_CARD1)
  {
    /* Check SD card detect pin */
    if((BSP_IO_ReadPin(SD1_DETECT_PIN)&SD1_DETECT_PIN) != SD1_DETECT_PIN)
    {
      if (UseExtiModeDetection)
      {
        BSP_IO_ConfigPin(SD1_DETECT_PIN, IO_MODE_IT_RISING_EDGE_PU);
      }
    }
    else
    {
      status = SD_NOT_PRESENT;
      if (UseExtiModeDetection)
      {
        BSP_IO_ConfigPin(SD1_DETECT_PIN, IO_MODE_IT_FALLING_EDGE_PU);
      }
    }
  }
  else
  {
    /* Check SD card detect pin */
    if((BSP_IO_ReadPin(SD2_DETECT_PIN)&SD2_DETECT_PIN) != SD2_DETECT_PIN)
    {
      if (UseExtiModeDetection)
      {
        BSP_IO_ConfigPin(SD2_DETECT_PIN, IO_MODE_IT_RISING_EDGE_PU);
      }
    }
    else
    {
      status = SD_NOT_PRESENT;
      if (UseExtiModeDetection)
      {
        BSP_IO_ConfigPin(SD2_DETECT_PIN, IO_MODE_IT_FALLING_EDGE_PU);
      }
    }    
  }
  return status;
}

/**
  * @brief  Reads block(s) from a specified address in an SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read
  * @param  NumOfBlocks: Number of SD blocks to read
  * @param  Timeout: Timeout for read operation
  * @retval SD status
  */
uint8_t BSP_SD_ReadBlocks(uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
  return BSP_SD_ReadBlocksEx(SD_CARD1, pData, ReadAddr, NumOfBlocks, Timeout);
}

/**
  * @brief  Reads block(s) from a specified address in an SD card, in polling mode.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2 
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read  
  * @param  NumOfBlocks: Number of SD blocks to read
  * @param  Timeout: Timeout for read operation
  * @retval SD status
  */
uint8_t BSP_SD_ReadBlocksEx(uint32_t SdCard, uint32_t *pData, uint32_t ReadAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
  HAL_StatusTypeDef  sd_state = HAL_OK;
  
  if(SdCard == SD_CARD1)
  {
    sd_state = HAL_SD_ReadBlocks(&uSdHandle, (uint8_t *)pData, ReadAddr, NumOfBlocks, Timeout);
  }
  else
  {
    sd_state = HAL_SD_ReadBlocks(&uSdHandle2, (uint8_t *)pData, ReadAddr, NumOfBlocks, Timeout);
  }
  
  if( sd_state == HAL_OK)
  {
    return MSD_OK;
  }
  else
  {
    return MSD_ERROR;
  }
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in polling mode. 
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written
  * @param  NumOfBlocks: Number of SD blocks to write
  * @param  Timeout: Timeout for write operation
  * @retval SD status
  */
uint8_t BSP_SD_WriteBlocks(uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
    return BSP_SD_WriteBlocksEx(SD_CARD1, pData, WriteAddr, NumOfBlocks, Timeout);
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in polling mode.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written  
  * @param  NumOfBlocks: Number of SD blocks to write
  * @param  Timeout: Timeout for write operation
  * @retval SD status
  */
uint8_t BSP_SD_WriteBlocksEx(uint32_t SdCard, uint32_t *pData, uint32_t WriteAddr, uint32_t NumOfBlocks, uint32_t Timeout)
{
  HAL_StatusTypeDef  sd_state = HAL_OK;
  
