iNavFlight/inav/lib/main/STM32F7/Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sd.c
    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(SD2_DMAx_Rx_IRQn, 0x0F, 0);
    HAL_NVIC_EnableIRQ(SD2_DMAx_Rx_IRQn);
    
    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(SD2_DMAx_Tx_IRQn, 0x0F, 0);
    HAL_NVIC_EnableIRQ(SD2_DMAx_Tx_IRQn);     
  }
}

/**
  * @brief  DeInitializes the SD MSP.
  * @param  hsd: SD handle
  * @param  Params  
  * @retval None
  */
__weak void BSP_SD_MspDeInit(SD_HandleTypeDef *hsd, void *Params)
{
  static DMA_HandleTypeDef dma_rx_handle;
  static DMA_HandleTypeDef dma_tx_handle;
  static DMA_HandleTypeDef dma_rx_handle2;
  static DMA_HandleTypeDef dma_tx_handle2;
  
  if(hsd->Instance == SDMMC1)
  {
    /* Disable NVIC for DMA transfer complete interrupts */
    HAL_NVIC_DisableIRQ(SD1_DMAx_Rx_IRQn);
    HAL_NVIC_DisableIRQ(SD1_DMAx_Tx_IRQn);
    
    /* Deinitialize the stream for new transfer */
    dma_rx_handle.Instance = SD1_DMAx_Rx_STREAM;
    HAL_DMA_DeInit(&dma_rx_handle);
    
    /* Deinitialize the stream for new transfer */
    dma_tx_handle.Instance = SD1_DMAx_Tx_STREAM;
    HAL_DMA_DeInit(&dma_tx_handle);
    
    /* Disable NVIC for SDIO interrupts */
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);
    
    /* DeInit GPIO pins can be done in the application 
    (by surcharging this __weak function) */
    
    /* Disable SDMMC1 clock */
    __HAL_RCC_SDMMC1_CLK_DISABLE();
  }
  else
  {    /* Disable NVIC for DMA transfer complete interrupts */
    HAL_NVIC_DisableIRQ(SD2_DMAx_Rx_IRQn);
    HAL_NVIC_DisableIRQ(SD2_DMAx_Tx_IRQn);
    
    /* Deinitialize the stream for new transfer */
    dma_rx_handle2.Instance = SD2_DMAx_Rx_STREAM;
    HAL_DMA_DeInit(&dma_rx_handle2);
    
    /* Deinitialize the stream for new transfer */
    dma_tx_handle2.Instance = SD2_DMAx_Tx_STREAM;
    HAL_DMA_DeInit(&dma_tx_handle2);
    
    /* Disable NVIC for SDIO interrupts */
    HAL_NVIC_DisableIRQ(SDMMC2_IRQn);
    
    /* DeInit GPIO pins can be done in the application 
    (by surcharging this __weak function) */
    
    /* Disable SDMMC2 clock */
    __HAL_RCC_SDMMC2_CLK_DISABLE();
  }
  /* GPIO pins clock and DMA clocks can be shut down in the application
  by surcharging this __weak function */ 
}

/**
  * @brief  Gets the current SD card data status.
  * @retval Data transfer state.
  *          This value can be one of the following values:
  *            @arg  SD_TRANSFER_OK: No data transfer is acting
  *            @arg  SD_TRANSFER_BUSY: Data transfer is acting
  */
uint8_t BSP_SD_GetCardState(void)
{
  return BSP_SD_GetCardStateEx(SD_CARD1);
}

/**
  * @brief  Gets the current SD card data status.
  * @param  SdCard: SD_CARD1 or SD_CARD2
  * @retval Data transfer state.
  *          This value can be one of the following values:
  *            @arg  SD_TRANSFER_OK: No data transfer is acting
  *            @arg  SD_TRANSFER_BUSY: Data transfer is acting
  */
uint8_t BSP_SD_GetCardStateEx(uint32_t SdCard)
{
  if(SdCard == SD_CARD1)
  {
    return((HAL_SD_GetCardState(&uSdHandle) == HAL_SD_CARD_TRANSFER ) ? SD_TRANSFER_OK : SD_TRANSFER_BUSY);
  }
  else
  {
    return((HAL_SD_GetCardState(&uSdHandle2) == HAL_SD_CARD_TRANSFER ) ? SD_TRANSFER_OK : SD_TRANSFER_BUSY);
  }
}

/**
  * @brief  Get SD information about specific SD card.
  * @param  CardInfo: Pointer to HAL_SD_CardInfoTypedef structure
  * @retval None 
  */
void BSP_SD_GetCardInfo(BSP_SD_CardInfo *CardInfo)
{
  BSP_SD_GetCardInfoEx(SD_CARD1, CardInfo);
}

/**
  * @brief  Get SD information about specific SD card.
  * @param  SdCard: SD card to be used, that should be SD_CARD1 or SD_CARD2  
  * @param  CardInfo: Pointer to HAL_SD_CardInfoTypedef structure
  * @retval None 
  */
void BSP_SD_GetCardInfoEx(uint32_t SdCard, BSP_SD_CardInfo *CardInfo)
{
  /* Get SD card Information */
  if(SdCard == SD_CARD1)
  {
    HAL_SD_GetCardInfo(&uSdHandle, CardInfo);
  }
  else
  {
    HAL_SD_GetCardInfo(&uSdHandle2, CardInfo);
  }
}

/**
  * @brief SD Abort callbacks
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_AbortCallback((hsd == &uSdHandle) ? SD_CARD1 : SD_CARD2);
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_WriteCpltCallback((hsd == &uSdHandle) ? SD_CARD1 : SD_CARD2);
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd: SD handle
  * @retval None
  */
void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_ReadCpltCallback((hsd == &uSdHandle) ? SD_CARD1 : SD_CARD2);
}

/**
  * @brief BSP SD Abort callbacks
  * @param SdCard: SD_CARD1 or SD_CARD2
  * @retval None
  */
__weak void BSP_SD_AbortCallback(uint32_t SdCard)
{

}

/**
  * @brief BSP Tx Transfer completed callbacks
  * @param SdCard: SD_CARD1 or SD_CARD2
  * @retval None
  */
__weak void BSP_SD_WriteCpltCallback(uint32_t SdCard)
{

}

/**
  * @brief BSP Rx Transfer completed callbacks
  * @param SdCard: SD_CARD1 or SD_CARD2
  * @retval None
  */
__weak void BSP_SD_ReadCpltCallback(uint32_t SdCard)
{

}
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */
 
